package com.example.fushuang.lyricview;

/**
 * Created by admin on 2017/6/7.
 */

public class LyricResult {

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"ret_code":0,"lyric":"[ti&#58;丑八怪]&#10;[ar&#58;薛之谦]&#10;[al&#58;意外]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;10]丑八怪&#32;&#40;《如果我爱你》电视剧插曲&#41;&#32;&#45;&#32;薛之谦&#10;[00&#58;00&#46;20]词：甘世佳&#10;[00&#58;00&#46;30]曲：李荣浩&#10;[00&#58;00&#46;40]编曲：李荣浩&#10;[00&#58;00&#46;50]&#10;[00&#58;20&#46;30]如果世界漆黑&#32;其实我很美&#10;[00&#58;22&#46;73]&#10;[00&#58;23&#46;59]在爱情里面进退&#32;最多被消费&#10;[00&#58;26&#46;66]&#10;[00&#58;27&#46;41]无关痛痒的是非&#10;[00&#58;29&#46;41]又怎么不对&#32;无所谓&#10;[00&#58;32&#46;58]&#10;[00&#58;35&#46;58]如果像你一样&#32;总有人赞美&#10;[00&#58;38&#46;34]&#10;[00&#58;39&#46;03]围绕着我的卑微&#32;也许能消退&#10;[00&#58;42&#46;14]&#10;[00&#58;42&#46;97]其实我并不在意&#32;有很多机会&#10;[00&#58;45&#46;93]&#10;[00&#58;46&#46;44]像巨人一样的无畏&#10;[00&#58;49&#46;25]放纵我&#32;心里的鬼&#10;[00&#58;50&#46;87]可是我不配&#10;[00&#58;52&#46;86]&#10;[00&#58;54&#46;12]丑八怪&#32;能否别把灯打开&#10;[01&#58;00&#46;54]&#10;[01&#58;01&#46;73]我要的爱&#32;出没在&#10;[01&#58;06&#46;22]漆黑一片的舞台&#10;[01&#58;08&#46;42]&#10;[01&#58;09&#46;23]丑八怪&#32;在这暧昧的时代&#10;[01&#58;15&#46;91]&#10;[01&#58;17&#46;34]我的存在&#32;像意外&#10;[01&#58;22&#46;59]&#10;[01&#58;37&#46;54]有人用一滴泪&#32;会红颜祸水&#10;[01&#58;40&#46;27]&#10;[01&#58;41&#46;09]有人丢掉称谓&#32;什么也不会&#10;[01&#58;43&#46;96]&#10;[01&#58;44&#46;89]只要你足够虚伪&#32;就不怕魔鬼&#32;对不对&#10;[01&#58;50&#46;08]&#10;[01&#58;53&#46;07]如果剧本写好&#32;谁比谁高贵&#10;[01&#58;55&#46;62]&#10;[01&#58;56&#46;43]我只能沉默以对&#32;美丽本无罪&#10;[01&#58;59&#46;55]&#10;[02&#58;00&#46;24]当欲望开始贪杯&#32;有更多机会&#10;[02&#58;03&#46;80]像尘埃一样的无畏&#32;化成灰&#32;谁认得谁&#10;[02&#58;08&#46;29]管他配不配&#10;[02&#58;10&#46;41]&#10;[02&#58;11&#46;72]丑八怪&#32;能否别把灯打开&#10;[02&#58;17&#46;97]&#10;[02&#58;19&#46;21]我要的爱&#32;出没在&#10;[02&#58;23&#46;58]漆黑一片的舞台&#10;[02&#58;25&#46;76]&#10;[02&#58;26&#46;64]丑八怪&#32;在这暧昧的时代&#10;[02&#58;33&#46;32]&#10;[02&#58;34&#46;81]我的存在&#32;不意外&#10;[02&#58;39&#46;71]&#10;[03&#58;01&#46;82]丑八怪&#32;其实见多就不怪&#10;[03&#58;08&#46;31]&#10;[03&#58;09&#46;68]放肆去high&#32;用力踩&#10;[03&#58;13&#46;80]那不堪一击的洁白&#10;[03&#58;15&#46;98]&#10;[03&#58;16&#46;98]丑八怪&#32;这是我们的时代&#10;[03&#58;23&#46;60]&#10;[03&#58;25&#46;21]我不存在&#32;才意外","lyric_txt":"                                 丑八怪      《如果我爱你》电视剧插曲            薛之谦      词：甘世佳      曲：李荣浩      编曲：李荣浩            如果世界漆黑   其实我很美            在爱情里面进退   最多被消费            无关痛痒的是非      又怎么不对   无所谓            如果像你一样   总有人赞美            围绕着我的卑微   也许能消退            其实我并不在意   有很多机会            像巨人一样的无畏      放纵我   心里的鬼      可是我不配            丑八怪   能否别把灯打开            我要的爱   出没在      漆黑一片的舞台            丑八怪   在这暧昧的时代            我的存在   像意外            有人用一滴泪   会红颜祸水            有人丢掉称谓   什么也不会            只要你足够虚伪   就不怕魔鬼   对不对            如果剧本写好   谁比谁高贵            我只能沉默以对   美丽本无罪            当欲望开始贪杯   有更多机会      像尘埃一样的无畏   化成灰   谁认得谁      管他配不配            丑八怪   能否别把灯打开            我要的爱   出没在      漆黑一片的舞台            丑八怪   在这暧昧的时代            我的存在   不意外            丑八怪   其实见多就不怪            放肆去high   用力踩      那不堪一击的洁白            丑八怪   这是我们的时代            我不存在   才意外"}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * ret_code : 0
         * lyric : [ti&#58;丑八怪]&#10;[ar&#58;薛之谦]&#10;[al&#58;意外]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;10]丑八怪&#32;&#40;《如果我爱你》电视剧插曲&#41;&#32;&#45;&#32;薛之谦&#10;[00&#58;00&#46;20]词：甘世佳&#10;[00&#58;00&#46;30]曲：李荣浩&#10;[00&#58;00&#46;40]编曲：李荣浩&#10;[00&#58;00&#46;50]&#10;[00&#58;20&#46;30]如果世界漆黑&#32;其实我很美&#10;[00&#58;22&#46;73]&#10;[00&#58;23&#46;59]在爱情里面进退&#32;最多被消费&#10;[00&#58;26&#46;66]&#10;[00&#58;27&#46;41]无关痛痒的是非&#10;[00&#58;29&#46;41]又怎么不对&#32;无所谓&#10;[00&#58;32&#46;58]&#10;[00&#58;35&#46;58]如果像你一样&#32;总有人赞美&#10;[00&#58;38&#46;34]&#10;[00&#58;39&#46;03]围绕着我的卑微&#32;也许能消退&#10;[00&#58;42&#46;14]&#10;[00&#58;42&#46;97]其实我并不在意&#32;有很多机会&#10;[00&#58;45&#46;93]&#10;[00&#58;46&#46;44]像巨人一样的无畏&#10;[00&#58;49&#46;25]放纵我&#32;心里的鬼&#10;[00&#58;50&#46;87]可是我不配&#10;[00&#58;52&#46;86]&#10;[00&#58;54&#46;12]丑八怪&#32;能否别把灯打开&#10;[01&#58;00&#46;54]&#10;[01&#58;01&#46;73]我要的爱&#32;出没在&#10;[01&#58;06&#46;22]漆黑一片的舞台&#10;[01&#58;08&#46;42]&#10;[01&#58;09&#46;23]丑八怪&#32;在这暧昧的时代&#10;[01&#58;15&#46;91]&#10;[01&#58;17&#46;34]我的存在&#32;像意外&#10;[01&#58;22&#46;59]&#10;[01&#58;37&#46;54]有人用一滴泪&#32;会红颜祸水&#10;[01&#58;40&#46;27]&#10;[01&#58;41&#46;09]有人丢掉称谓&#32;什么也不会&#10;[01&#58;43&#46;96]&#10;[01&#58;44&#46;89]只要你足够虚伪&#32;就不怕魔鬼&#32;对不对&#10;[01&#58;50&#46;08]&#10;[01&#58;53&#46;07]如果剧本写好&#32;谁比谁高贵&#10;[01&#58;55&#46;62]&#10;[01&#58;56&#46;43]我只能沉默以对&#32;美丽本无罪&#10;[01&#58;59&#46;55]&#10;[02&#58;00&#46;24]当欲望开始贪杯&#32;有更多机会&#10;[02&#58;03&#46;80]像尘埃一样的无畏&#32;化成灰&#32;谁认得谁&#10;[02&#58;08&#46;29]管他配不配&#10;[02&#58;10&#46;41]&#10;[02&#58;11&#46;72]丑八怪&#32;能否别把灯打开&#10;[02&#58;17&#46;97]&#10;[02&#58;19&#46;21]我要的爱&#32;出没在&#10;[02&#58;23&#46;58]漆黑一片的舞台&#10;[02&#58;25&#46;76]&#10;[02&#58;26&#46;64]丑八怪&#32;在这暧昧的时代&#10;[02&#58;33&#46;32]&#10;[02&#58;34&#46;81]我的存在&#32;不意外&#10;[02&#58;39&#46;71]&#10;[03&#58;01&#46;82]丑八怪&#32;其实见多就不怪&#10;[03&#58;08&#46;31]&#10;[03&#58;09&#46;68]放肆去high&#32;用力踩&#10;[03&#58;13&#46;80]那不堪一击的洁白&#10;[03&#58;15&#46;98]&#10;[03&#58;16&#46;98]丑八怪&#32;这是我们的时代&#10;[03&#58;23&#46;60]&#10;[03&#58;25&#46;21]我不存在&#32;才意外
         * lyric_txt :                                  丑八怪      《如果我爱你》电视剧插曲            薛之谦      词：甘世佳      曲：李荣浩      编曲：李荣浩            如果世界漆黑   其实我很美            在爱情里面进退   最多被消费            无关痛痒的是非      又怎么不对   无所谓            如果像你一样   总有人赞美            围绕着我的卑微   也许能消退            其实我并不在意   有很多机会            像巨人一样的无畏      放纵我   心里的鬼      可是我不配            丑八怪   能否别把灯打开            我要的爱   出没在      漆黑一片的舞台            丑八怪   在这暧昧的时代            我的存在   像意外            有人用一滴泪   会红颜祸水            有人丢掉称谓   什么也不会            只要你足够虚伪   就不怕魔鬼   对不对            如果剧本写好   谁比谁高贵            我只能沉默以对   美丽本无罪            当欲望开始贪杯   有更多机会      像尘埃一样的无畏   化成灰   谁认得谁      管他配不配            丑八怪   能否别把灯打开            我要的爱   出没在      漆黑一片的舞台            丑八怪   在这暧昧的时代            我的存在   不意外            丑八怪   其实见多就不怪            放肆去high   用力踩      那不堪一击的洁白            丑八怪   这是我们的时代            我不存在   才意外
         */

        private int ret_code;
        private String lyric;
        private String lyric_txt;

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public String getLyric() {
            return lyric;
        }

        public void setLyric(String lyric) {
            this.lyric = lyric;
        }

        public String getLyric_txt() {
            return lyric_txt;
        }

        public void setLyric_txt(String lyric_txt) {
            this.lyric_txt = lyric_txt;
        }
    }
}
